wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer_V2/Core/Inc/main.h
	const carTemperature_type waterHighTempWarningThreshold_min;
	const carTemperature_type waterHighTempWarningThreshold_max;
	const carTemperature_type waterHighTempAlarmThreshold_min;
	const carTemperature_type waterHighTempAlarmThreshold_max;
	const carTemperature_type waterHighTempFanOnThreshold_min;
	const carTemperature_type waterHighTempFanOnThreshold_max;
	const carTemperature_type waterHighTempFanOffThreshold_min;
	const carTemperature_type waterHighTempFanOffThreshold_max;

	const carTemperature_type oilHighTempWarningThreshold_min;
	const carTemperature_type oilHighTempWarningThreshold_max;
	const carTemperature_type oilHighTempAlarmThreshold_min;
	const carTemperature_type oilHighTempAlarmThreshold_max;

	const carOilAnalogPressure_type oilHighPressureAlarmThreshold_min;
	const carOilAnalogPressure_type oilHighPressureAlarmThreshold_max;
	const carOilAnalogPressure_type oilLowPressureAlarmThreshold_min;
	const carOilAnalogPressure_type oilLowPressureAlarmThreshold_max;

	const carVoltage_type batteryLowVoltageAlarmThreshold_min;
	const carVoltage_type batteryLowVoltageAlarmThreshold_max;
	const carVoltage_type batteryHighVoltageAlarmThreshold_min;
	const carVoltage_type batteryHighVoltageAlarmThreshold_max;

	const cafFuelLevel_type fuelLowLevelWarningThreshold_min;
	const cafFuelLevel_type fuelLowLevelWarningThreshold_max;

	const boardVoltage_type board3V3SupplyLowThreshold_min;
	const boardVoltage_type board3V3SupplyLowThreshold_max;
	const boardVoltage_type board3V3SupplyHighThreshold_min;
	const boardVoltage_type board3V3SupplyHighThreshold_max;
	const boardVoltage_type board5VSupplyLowThreshold_min;
	const boardVoltage_type board5VSupplyLowThreshold_max;
	const boardVoltage_type board5VSupplyHighThreshold_min;
	const boardVoltage_type board5VSupplyHighThreshold_max;
	const boardVoltage_type boardVinSupplyLowThreshold_min;
	const boardVoltage_type boardVinSupplyLowThreshold_max;

	const boardTemperature_type board5VDCDCTemperatureHighThreshold_min;
	const boardTemperature_type board5VDCDCTemperatureHighThreshold_max;
	const boardTemperature_type board3V3DCDCTemperatureHighThreshold_min;
	const boardTemperature_type board3V3DCDCTemperatureHighThreshold_max;

	const Enum_Layer homeScreen_min;
	const Enum_Layer homeScreen_max;
	const LCDSettings_type autoHomeReturnTime_min;
	const LCDSettings_type autoHomeReturnTime_max;
	const LCDSettings_type backlightLevel_min;
	const LCDSettings_type backlightLevel_max;
	const LCDSettings_type secondsToAutoTurnOffBacklight_min;
	const LCDSettings_type secondsToAutoTurnOffBacklight_max;
	const LCDSettings_type autoBacklightOffHourStart_min;
	const LCDSettings_type autoBacklightOffHourStart_max;
	const LCDSettings_type autoBacklightOffHourEnd_min;
	const LCDSettings_type autoBacklightOffHourEnd_max;

}GlobalValuesLimits_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
// @formatter:on
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DCDC_5V_ENABLE_Pin GPIO_PIN_10
#define DCDC_5V_ENABLE_GPIO_Port GPIOI
#define BUZZER_Pin GPIO_PIN_11
#define BUZZER_GPIO_Port GPIOI
#define LCD_I2C2_SDA_Pin GPIO_PIN_0
#define LCD_I2C2_SDA_GPIO_Port GPIOF
#define LCD_I2C2_SCL_Pin GPIO_PIN_1
#define LCD_I2C2_SCL_GPIO_Port GPIOF
#define POWER_ON_LCD_Pin GPIO_PIN_2
#define POWER_ON_LCD_GPIO_Port GPIOF
#define DCDC_3V3_Pin GPIO_PIN_3
#define DCDC_3V3_GPIO_Port GPIOF
#define DCDC_5V_Pin GPIO_PIN_4
#define DCDC_5V_GPIO_Port GPIOF
#define H_BRIDGE_DRIVER_Pin GPIO_PIN_5
#define H_BRIDGE_DRIVER_GPIO_Port GPIOF
#define AUXILIARY_BATTERY_Pin GPIO_PIN_6
#define AUXILIARY_BATTERY_GPIO_Port GPIOF
#define MAIN_BATTERY_Pin GPIO_PIN_7
#define MAIN_BATTERY_GPIO_Port GPIOF
#define LM35_3_N_Pin GPIO_PIN_8
#define LM35_3_N_GPIO_Port GPIOF
#define LM35_3_P_Pin GPIO_PIN_9
#define LM35_3_P_GPIO_Port GPIOF
#define LM35_2_N_Pin GPIO_PIN_10
#define LM35_2_N_GPIO_Port GPIOF
#define LM35_2_P_Pin GPIO_PIN_0
#define LM35_2_P_GPIO_Port GPIOC
#define LM35_1_N_Pin GPIO_PIN_1
#define LM35_1_N_GPIO_Port GPIOC
#define LM35_1_P_Pin GPIO_PIN_2
#define LM35_1_P_GPIO_Port GPIOC
#define LM35_5_N_Pin GPIO_PIN_3
#define LM35_5_N_GPIO_Port GPIOC
#define LM35_5_P_Pin GPIO_PIN_0
#define LM35_5_P_GPIO_Port GPIOA
#define LM35_4_N_Pin GPIO_PIN_1
#define LM35_4_N_GPIO_Port GPIOA
#define LM35_4_P_Pin GPIO_PIN_2
#define LM35_4_P_GPIO_Port GPIOA
#define DIAG_LED_1_Pin GPIO_PIN_2
#define DIAG_LED_1_GPIO_Port GPIOH
#define DIAG_LED_2_Pin GPIO_PIN_3
#define DIAG_LED_2_GPIO_Port GPIOH
#define DIAG_LED_3_Pin GPIO_PIN_4
#define DIAG_LED_3_GPIO_Port GPIOH
#define DIAG_LED_4_Pin GPIO_PIN_5
#define DIAG_LED_4_GPIO_Port GPIOH
#define VOLTAGE_VIN_Pin GPIO_PIN_3
#define VOLTAGE_VIN_GPIO_Port GPIOA
#define POTENTIOMETER_2_Pin GPIO_PIN_4
#define POTENTIOMETER_2_GPIO_Port GPIOA
#define POTENTIOMETER_1_Pin GPIO_PIN_5
#define POTENTIOMETER_1_GPIO_Port GPIOA
#define RESISTANCE_SENSOR_2_Pin GPIO_PIN_6
#define RESISTANCE_SENSOR_2_GPIO_Port GPIOA
#define RESISTANCE_SENSOR_1_Pin GPIO_PIN_7
#define RESISTANCE_SENSOR_1_GPIO_Port GPIOA
#define VOLTAGE_5V_Pin GPIO_PIN_4
#define VOLTAGE_5V_GPIO_Port GPIOC
#define VOLTAGE_3V3_Pin GPIO_PIN_5
#define VOLTAGE_3V3_GPIO_Port GPIOC
#define FUEL_LEVEL_Pin GPIO_PIN_0
#define FUEL_LEVEL_GPIO_Port GPIOB
#define ACC_POSITION_Pin GPIO_PIN_1
#define ACC_POSITION_GPIO_Port GPIOB
#define OIL_PRESSURE_BINARY_Pin GPIO_PIN_12
#define OIL_PRESSURE_BINARY_GPIO_Port GPIOF
#define EEPROM_WP2_Pin GPIO_PIN_10
#define EEPROM_WP2_GPIO_Port GPIOB
#define EEPROM_WP1_Pin GPIO_PIN_11
#define EEPROM_WP1_GPIO_Port GPIOB
#define EEPROM_I2C3_SCL_Pin GPIO_PIN_7
#define EEPROM_I2C3_SCL_GPIO_Port GPIOH
#define EEPROM_I2C3_SDA_Pin GPIO_PIN_8
#define EEPROM_I2C3_SDA_GPIO_Port GPIOH
#define MICROSD_DETECT_Pin GPIO_PIN_13
#define MICROSD_DETECT_GPIO_Port GPIOB
#define SPEED_SIGNAL_Pin GPIO_PIN_4
#define SPEED_SIGNAL_GPIO_Port GPIOG
#define SPEED_SIGNAL_EXTI_IRQn EXTI4_IRQn
#define RPM_SIGNAL_Pin GPIO_PIN_6
#define RPM_SIGNAL_GPIO_Port GPIOG
#define RPM_SIGNAL_EXTI_IRQn EXTI9_5_IRQn
#define ENCODER_1_BUTTON_Pin GPIO_PIN_8
#define ENCODER_1_BUTTON_GPIO_Port GPIOG
#define ENCODER_1_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define ENCODER_1_A_Pin GPIO_PIN_8
#define ENCODER_1_A_GPIO_Port GPIOA
#define ENCODER_1_B_Pin GPIO_PIN_9
#define ENCODER_1_B_GPIO_Port GPIOA
#define POWER_ON_MICROSD_Pin GPIO_PIN_0
#define POWER_ON_MICROSD_GPIO_Port GPIOD
#define POWER_ON_NODEMCU_Pin GPIO_PIN_13
#define POWER_ON_NODEMCU_GPIO_Port GPIOG
#define POWER_ON_GPS_Pin GPIO_PIN_15
#define POWER_ON_GPS_GPIO_Port GPIOG
#define GPS_USART1_TX_Pin GPIO_PIN_6
#define GPS_USART1_TX_GPIO_Port GPIOB
#define GPS_USART1_RX_Pin GPIO_PIN_7
#define GPS_USART1_RX_GPIO_Port GPIOB
#define FRAM_I2C1_SCL_Pin GPIO_PIN_8
#define FRAM_I2C1_SCL_GPIO_Port GPIOB
#define FRAM_I2C1_SDA_Pin GPIO_PIN_9
#define FRAM_I2C1_SDA_GPIO_Port GPIOB
#define FRAM_WP_Pin GPIO_PIN_0
#define FRAM_WP_GPIO_Port GPIOE
#define FAN_BOARD_Pin GPIO_PIN_5
#define FAN_BOARD_GPIO_Port GPIOI
#define POWER_ON_CRUISE_CONTROL_Pin GPIO_PIN_7
#define POWER_ON_CRUISE_CONTROL_GPIO_Port GPIOI
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
